# **Pandas**

# Series

<hr>

In [1]:
import numpy as np
import pandas as pd

## **Creating a Series**

## 1. From a Python List

In [3]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

## 2. From a Numpy Array

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [12]:
pd.Series(arr, labels )

a    10
b    20
c    30
dtype: int32

## 3. From a Dictionary

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

<hr>

## Using an Index

In [14]:
ser1 = pd.Series([1,2,3,4], index = ['Bandung', 'Jakarta', 'Semarang', 'Surabaya'])
ser1

Bandung     1
Jakarta     2
Semarang    3
Surabaya    4
dtype: int64

In [15]:
ser1['Jakarta']

2

In [16]:
ser2 = pd.Series([1,2,3,4], index = ['Bandung', 'Jakarta', 'Serang', 'Surabaya'])
ser2

Bandung     1
Jakarta     2
Serang      3
Surabaya    4
dtype: int64

In [17]:
ser1 + ser2

Bandung     2.0
Jakarta     4.0
Semarang    NaN
Serang      NaN
Surabaya    8.0
dtype: float64

<hr>

# **DataFrame**

In [2]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                  index = ['Jakarta', 'Bandung', 'Bekasi'],
                  columns=['Maret', 'April', 'Mei'])
df

         Maret  April  Mei
Jakarta      1      2    3
Bandung      4      5    6
Bekasi       7      8    9

## Selection and Indexing

In [4]:
# menampilkan data pada kolom 'April'
df['April']

Jakarta    2
Bandung    5
Bekasi     8
Name: April, dtype: int32

In [5]:
# menampilkan data pada kolom "Maret" dan "Mei"
df[['Maret', 'Mei']]

         Maret  Mei
Jakarta      1    3
Bandung      4    6
Bekasi       7    9

In [6]:
type(df['Maret'])

pandas.core.series.Series

## Creating a New Column

In [9]:
# Membuat kolom baru dengan nama 'Juni', diisi dengan hasil penjumlahan kolom 'Maret', 'April', 'Mei'
df['Juni'] = df['Maret'] + df['April'] + df['Mei']
df

         Maret  April  Mei  Juni
Jakarta      1      2    3     6
Bandung      4      5    6    15
Bekasi       7      8    9    24

## Removing Columns

In [8]:
# tanpa inplace
df.drop('Juni', axis = 1)

         Maret  April  Mei
Jakarta      1      2    3
Bandung      4      5    6
Bekasi       7      8    9

In [10]:
df

         Maret  April  Mei  Juni
Jakarta      1      2    3     6
Bandung      4      5    6    15
Bekasi       7      8    9    24

In [11]:
# dengan inplace
df.drop('Juni', axis=1, inplace = True)

In [12]:
df

         Maret  April  Mei
Jakarta      1      2    3
Bandung      4      5    6
Bekasi       7      8    9

## Removing Row

In [14]:
# tanpa inplace 
df.drop('Bekasi', axis=0)

         Maret  April  Mei
Jakarta      1      2    3
Bandung      4      5    6

In [15]:
df

         Maret  April  Mei
Jakarta      1      2    3
Bandung      4      5    6
Bekasi       7      8    9

In [16]:
df.drop('Bekasi', axis=0, inplace=True)

In [17]:
df

         Maret  April  Mei
Jakarta      1      2    3
Bandung      4      5    6